knowledge_compiler/phase2/execution_layer/templates/openfoam/BENCH-01/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0 0 0)
    ({{DOMAIN_SIZE}} 0 0)
    ({{DOMAIN_SIZE}} {{DOMAIN_SIZE}} 0)
    (0 {{DOMAIN_SIZE}} 0)
    (0 0 {{THICKNESS}})
    ({{DOMAIN_SIZE}} 0 {{THICKNESS}})
    ({{DOMAIN_SIZE}} {{DOMAIN_SIZE}} {{THICKNESS}})
    (0 {{DOMAIN_SIZE}} {{THICKNESS}})
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ({{NX}} {{NY}} 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 2 6 7)
        );
    }

    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (1 2 6 5)
            (0 1 5 4)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
